---
kind: other
id: Methods.T:Autodesk.Revit.DB.BeamSystemType
source: html/3004d330-4ce9-d4bd-daa3-7ddac3fdadf9.htm
---
# BeamSystemType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.